const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', ()=> {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ ?' ,()=>{
expect(sum(2,5))
});

// 20 + 2 เท่ากับ 22
test('20 + 2 เท่ากับ 21', ()=> {
  expect(sum(20,2)).toBe(22);
});


// 15 + 5 เท่ากับ 20
test('15 + 5 เท่ากับ 20', ()=> {
  expect(sum(15,5)).toBe(20);
});

// 15 + 5 เท่ากับ 20
test('10 + 5 เท่ากับ 25', ()=> {
  expect(sum(10,5)).toBe(15);
});